Revit 2027 API
DocumentPreviewSettings.IsViewUpdateForced Property
 Identifies if Revit will update the preview view if necessary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsViewUpdateForced { get; }
Public ReadOnly Property IsViewUpdateForced As Boolean
	Get
public:
property bool IsViewUpdateForced {
	bool get ();
}
member IsViewUpdateForced : bool with get
Property Value
Boolean
Remarks
 This setting applies only to a single Save operation and is reset to false after it is accessed.
See Also
Reference
DocumentPreviewSettings Class
Autodesk.Revit.DB Namespace